# len:取得字典中有多少組key-value配對
d = {"蘋果": 20, "香蕉": 30, "梨": 40}
print(len(d))

# 檢查某個key是否存在於字典中
# 先檢查可避免錯誤
d = {"蘋果": 20, "香蕉": 30, "梨": 40}
print("蘋果" in d)
print("蓮霧" in d)

# 檢查某元素有沒有在list中
l = [1, 2, 3, 4, 5]
print(1 in l)

# 比較複雜的list
d = {
    "a": [
        1,
        2,
        3,
    ],
    "b": {"c": 4, "d": 5},
}
print(d["a"])
print(d["a"][0])
print(d["b"])
print(d["b"]["c"])

# 成績登記
grade = {
    "學生1": {"國文": [90, 80, 70], "數學": [95, 85, 75], "英文": [80, 70, 60]},
    "學生2": {"國文": [80, 70, 60], "數學": [90, 80, 70], "英文": [95, 85, 75]},
    "學生3": {"國文": [70, 60, 50], "數學": [80, 70, 60], "英文": [90, 80, 70]},
}

# 取得小名數學成績
print(grade["學生1"]["數學"])

# 取得小美第一次英文成績
print(grade["學生2"]["英文"][0])

# 取得小華第二次國文成績
print(grade["學生3"]["國文"][1])
